# Hello World
greet <- function() {
    print("HelloWorld!")
}
greet()

# 変数
> a <- 123 #代入
> a
[1] 123
> 
> a <- a + 1
> a
[1] 124
> 
> a %% 5 #余りの演算
[1] 4

# 制御構文
a<-"犬"
switch(a,
    "犬"=print("わん"),
    "猫"=print("にゃん"),
    "鳥"=print("ぴよ"),
    print("ぎゃふん")
)

# 関数
f<-function(a,b=2){
  return(a * b)
# a*b #←return省略も可能
}
> f(2)
[1] 4
> f(b=3,a=2)
[1] 6

# ベクトル操作
> vec <- c(1,2,1,2,3,4,1,2,3)
> vec
[1] 1 2 1 2 3 4 1 2 3
> vec[3]
[1] 1

# ベクトル演算
> vec1 <- c(4,5,2,3)
> vec2 <- c(1,2,1,2)
> 
> vec1 / 2
[1] 2.0 2.5 1.0 1.5
> vec1 - vec2
[1] 3 3 1 1
> vec1 * vec2
[1]  4 10  2  6

# ベクトル生成
> seq(1,10,length=5)  #1~10を5分割で
[1]  1.00  3.25  5.50  7.75 10.00
> seq(1,10,by=2) #1から2ずつやして10まで
[1] 1 3 5 7 9

> rep(1:3,times=2) #(1,2,3)を2回
[1] 1 2 3 1 2 3
> rep(1:3,length=5) #(1,2,3)を5個になるまで繰り返す
[1] 1 2 3 1 2

# 日付生成
> seq(as.Date("2016-01-01"),as.Date("2016-01-05"),by="day")
[1] "2016-01-01" "2016-01-02" "2016-01-03" "2016-01-04"
[5] "2016-01-05"

# 集計関数
> v <- c(4,5,2,3)
> max(v)
[1] 5
> which.min(v)
[1] 3
> mean(v)
[1] 3.5
> summary(v)
Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
2.00    2.75    3.50    3.50    4.25    5.00 

# データフレーム
data <- data.frame(
    "商品" = c("りんご","たまご","キャベツ"),
    "値段" = c(100,20,120)
)
> data
商品 値段
1   りんご  100
2   たまご   20
3 キャベツ  120
> head(data)
    商品 値段
1   りんご  100
2   たまご   20
3 キャベツ  120

# apply関数群
> data
A店 B店 C店
1  80 100  90
2  80  20  90
3 110 120  90
> apply(data,2,sum)
A店 B店 C店 
270 240 270 

# apply自作関数
> apply(data,1,function(v){return(min(v)*1.08)})
[1] 86.4 21.6 97.2
